FranciszekJanicki/devcontainer-stm32-cubemx-invertedsway/Core/Src/main.cpp
/* USER CODE BEGIN Header */
/**
 ******************************************************************************
 * @file           : main.c
 * @brief          : Main program body
 ******************************************************************************
 * @attention
 *
 * Copyright (c) 2024 STMicroelectronics.
 * All rights reserved.
 *
 * This software is licensed under terms that can be found in the LICENSE file
 * in the root directory of this software component.
 * If no LICENSE file comes with this software, it is provided AS-IS.
 *
 ******************************************************************************
 */
/* USER CODE END Header */
/* Includes ------------------------------------------------------------------*/
#include "main.h"
#include "gpio.h"
#include "i2c.h"
#include "stm32l4xx_hal.h"
#include "usart.h"

/* Private includes ----------------------------------------------------------*/
/* USER CODE BEGIN Includes */
#include "mpu6050.hpp"
#include "mpu6050_config.hpp"
#include <cmsis_gcc.h>
#include <cstdio>
#include <cstring>
#include <stm32_hal_legacy.h>
#include <stm32l4xx_hal_pwr_ex.h>
#include <stm32l4xx_hal_rcc.h>

/* USER CODE END Includes */

/* Private typedef -----------------------------------------------------------*/
/* USER CODE BEGIN PTD */

/* USER CODE END PTD */

/* Private define ------------------------------------------------------------*/
/* USER CODE BEGIN PD */

/* USER CODE END PD */

/* Private macro -------------------------------------------------------------*/
/* USER CODE BEGIN PM */

/* USER CODE END PM */

/* Private variables ---------------------------------------------------------*/

/* USER CODE BEGIN PV */
std::uint8_t buffer[128];
/* USER CODE END PV */

/* Private function prototypes -----------------------------------------------*/
void SystemClock_Config(void);
static void MX_NVIC_Init(void);
/* USER CODE BEGIN PFP */
void UART2_SendString(char* s)
{
    HAL_UART_Transmit(&huart2, (uint8_t*)s, strlen(s), 1000);
}
/* USER CODE END PFP */

/* Private user code ---------------------------------------------------------*/
/* USER CODE BEGIN 0 */

/* USER CODE END 0 */

/**
 * @brief  The application entry point.
 * @retval int
 */
int main(void)
{
    /* USER CODE BEGIN 1 */

    /* USER CODE END 1 */

    /* MCU Configuration--------------------------------------------------------*/

    /* Reset of all peripherals, Initializes the Flash interface and the Systick. */
    HAL_Init();

    /* USER CODE BEGIN Init */

    /* USER CODE END Init */

    /* Configure the system clock */
    SystemClock_Config();

    /* USER CODE BEGIN SysInit */

    /* USER CODE END SysInit */

    /* Initialize all configured peripherals */
    MX_GPIO_Init();
    MX_I2C1_Init();
    MX_USART2_UART_Init();
    /* Initialize interrupts */
    MX_NVIC_Init();
    /* USER CODE BEGIN 2 */
    // MPU6050::Init(hi2c1, GYRO_FS_250, ACCEL_FS_2);

    // MPU6050::SetInterruptMode(hi2c1, INTMODE_ACTIVEHIGH);
    // MPU6050::SetInterruptDrive(hi2c1, INTDRV_PUSHPULL);
    // MPU6050::SetInterruptLatch(hi2c1, INTLATCH_WAITCLEAR);
    // MPU6050::SetInterruptLatchClear(hi2c1, INTCLEAR_STATUSREAD);

    // MPU6050::SetIntEnableRegister(hi2c1, 0); // Disable all interrupts

    // // Enable Motion interrputs
    // MPU6050::SetDHPFMode(hi2c1, DHPF_5);

    // MPU6050::SetIntMotionEnabled(hi2c1, 1);
    // MPU6050::SetIntZeroMotionEnabled(hi2c1, 1);
    // MPU6050::SetIntFreeFallEnabled(hi2c1, 1);

    // MPU6050::SetFreeFallDetectionDuration(hi2c1, 2);
    // MPU6050::SetFreeFallDetectionThreshold(hi2c1, 5);

    // MPU6050::SetMotionDetectionDuration(hi2c1, 5);
    // MPU6050::SetMotionDetectionThreshold(hi2c1, 2);

    // MPU6050::SetZeroMotionDetectionDuration(hi2c1, 2);
    // MPU6050::SetZeroMotionDetectionThreshold(hi2c1, 4);

    /* USER CODE END 2 */

    /* Infinite loop */
    /* USER CODE BEGIN WHILE */
    while (true) {
        /* USER CODE END WHILE */

        // /* USER CODE BEGIN 3 */
        // const auto& [ax, ay, az]{MPU6050::GetAccelerometerScaled(hi2c1, ACCEL_FS_2)};
        // const auto& [gx, gy, gz]{MPU6050::GetGyroscopeScaled(hi2c1, GYRO_FS_250)};
        // const auto temperature{MPU6050::GetTemperatureCelsius(hi2c1)};
        // memset(buffer, 0, 128);
        // sprintf((char*)buffer,
        //         "ACC: X: %.2f Y:%.2f Z:%.2f \n\rGYR: X: %.2f Y:%.2f "
        //         "Z:%.2f\n\rTEMP: %.2f\n\r",
        //         ax,
        //         ay,
        //         az,
        //         gx,
        //         gy,
        //         gz,
        //         temperature);
        // UART2_SendString((char*)buffer);

        // const auto& [roll, pitch, yaw]{MPU6050::GetRollPitchYaw(hi2c1, ACCEL_FS_2)};
        // memset(buffer, 0, 128);
        // sprintf((char*)buffer, "RPY: Roll: %.2f Pitch: %.2f\n\r\n\r", roll, pitch);
        // UART2_SendString((char*)buffer);
        HAL_Delay(1000);

        HAL_GPIO_TogglePin(LED_GPIO_Port, LED_Pin);
    }
    /* USER CODE END 3 */
}

/**
 * @brief System Clock Configuration
 * @retval None
 */
void SystemClock_Config(void)
{
    RCC_OscInitTypeDef RCC_OscInitStruct = {0};
    RCC_ClkInitTypeDef RCC_ClkInitStruct = {0};

    /** Configure the main internal regulator output voltage
     */
    if (HAL_PWREx_ControlVoltageScaling(PWR_REGULATOR_VOLTAGE_SCALE1) != HAL_OK) {
        Error_Handler();
    }

    /** Initializes the RCC Oscillators according to the specified parameters
     * in the RCC_OscInitTypeDef structure.
     */
    RCC_OscInitStruct.OscillatorType = RCC_OSCILLATORTYPE_HSI;
    RCC_OscInitStruct.HSIState = RCC_HSI_ON;
    RCC_OscInitStruct.HSICalibrationValue = RCC_HSICALIBRATION_DEFAULT;
    RCC_OscInitStruct.PLL.PLLState = RCC_PLL_ON;
    RCC_OscInitStruct.PLL.PLLSource = RCC_PLLSOURCE_HSI;
    RCC_OscInitStruct.PLL.PLLM = 1;
    RCC_OscInitStruct.PLL.PLLN = 10;
    RCC_OscInitStruct.PLL.PLLP = RCC_PLLP_DIV7;
    RCC_OscInitStruct.PLL.PLLQ = RCC_PLLQ_DIV2;
    RCC_OscInitStruct.PLL.PLLR = RCC_PLLR_DIV2;
    if (HAL_RCC_OscConfig(&RCC_OscInitStruct) != HAL_OK) {
        Error_Handler();
    }

    /** Initializes the CPU, AHB and APB buses clocks
     */
    RCC_ClkInitStruct.ClockType = RCC_CLOCKTYPE_HCLK | RCC_CLOCKTYPE_SYSCLK | RCC_CLOCKTYPE_PCLK1 | RCC_CLOCKTYPE_PCLK2;
    RCC_ClkInitStruct.SYSCLKSource = RCC_SYSCLKSOURCE_PLLCLK;
    RCC_ClkInitStruct.AHBCLKDivider = RCC_SYSCLK_DIV1;
    RCC_ClkInitStruct.APB1CLKDivider = RCC_HCLK_DIV1;
    RCC_ClkInitStruct.APB2CLKDivider = RCC_HCLK_DIV1;

    if (HAL_RCC_ClockConfig(&RCC_ClkInitStruct, FLASH_LATENCY_4) != HAL_OK) {
        Error_Handler();
    }
}

/* USER CODE BEGIN 4 */
static void MX_NVIC_Init(void)
{
    /* EXTI9_5_IRQn interrupt configuration */
    HAL_NVIC_SetPriority(EXTI9_5_IRQn, 0, 0);
    HAL_NVIC_EnableIRQ(EXTI9_5_IRQn);
}

void HAL_GPIO_EXTI_Callback(uint16_t GPIO_Pin)
{
    if (GPIO_Pin == INTR_Pin) {
        uint8_t interrupts = MPU6050::GetIntStatusRegister(hi2c1);
        MPU6050::GetMotionStatusRegister(hi2c1);
        sprintf((char*)buffer, "Int status triggered: %X\n\n\r", interrupts);
        UART2_SendString((char*)buffer);

        if (interrupts & (0x01 << INTERRUPT_FIFO_OFLOW_BIT)) // Bit 4 (0x10)
        {
            sprintf((char*)buffer, "FIFO Overflow detected\n\r");
            UART2_SendString((char*)buffer);
        }

        if (interrupts & (0x01 << INTERRUPT_MOT_BIT)) // Bit 6 (0x40)
        {
            sprintf((char*)buffer, "Motion detected\n\r");
            UART2_SendString((char*)buffer);
        }

        if (interrupts & (0x01 << INTERRUPT_ZMOT_BIT)) // Bit 5 (0x20)
        {
            sprintf((char*)buffer, "Zero Motion detected\n\r");
            UART2_SendString((char*)buffer);
        }

        if (interrupts & (0x01 << INTERRUPT_FF_BIT)) // Bit 7 (0x80)
        {
            sprintf((char*)buffer, "Freefall detected\n\r");
            UART2_SendString((char*)buffer);
        }
    }
}
/* USER CODE END 4 */

/**
 * @brief  This function is executed in case of error occurrence.
 * @retval None
 */
void Error_Handler(void)
{
    /* USER CODE BEGIN Error_Handler_Debug */
    /* User can add his own implementation to report the HAL error return state */
    __disable_irq();
    while (1) {
    }
    /* USER CODE END Error_Handler_Debug */
}

#ifdef USE_FULL_ASSERT
/**
 * @brief  Reports the name of the source file and the source line number
 *         where the assert_param error has occurred.
 * @param  file: pointer to the source file name
 * @param  line: assert_param error line source number
 * @retval None
 */
void assert_failed(uint8_t* file, uint32_t line)
{
    /* USER CODE BEGIN 6 */
    /* User can add his own implementation to report the file name and line number,
       ex: printf("Wrong parameters value: file %s on line %d\r\n", file, line) */
    /* USER CODE END 6 */
}
#endif /* USE_FULL_ASSERT */
